package shafin.nlp.pos;

import java.io.IOException;
import edu.stanford.nlp.tagger.maxent.MaxentTagger;

public class PosTagger {

	public static void main(String[] args) throws ClassNotFoundException, IOException {

		// The sample string
		String sample = "‘আরাফাত সানির বোলিং অ্যাকশন অবৈধ’—কাল দুপুরের এই খবরটা হজম হতে না হতেই এল আরও বড় ধাক্কা। বিকেলেই আইসিসির ঘোষণা, কোনো কোনো ডেলিভারিতে তাসকিন আহমেদের কনুইও ১৫ ডিগ্রির বেশি বেঁকে যায়। সানির সঙ্গে তাই তিনিও বোলিং থেকে নিষিদ্ধ। তবে চেন্নাইয়ের রামাচন্দ্র বিশ্ববিদ্যালয়ের পরীক্ষাগারে তাসকিনের বোলিং অ্যাকশনের পরীক্ষায় যে প্রক্রিয়া অনুসরণ করা হয়েছে, প্রশ্ন উঠেছে সেটির বৈধতা নিয়েই।"
				+ "বিসিবি সূত্র জানিয়েছে, ১৫ মার্চের পরীক্ষায় মাত্র ৩-৪ মিনিটের মধ্যে তাসকিনকে ৮-৯টি বাউন্সার দিতে বলা হয়। এর মধ্যে তিনটি বাউন্সারে অবৈধ অ্যাকশন ধরা পড়েছে। এত অল্প সময়ে অতগুলো বাউন্সার দিতে হলে এ রকম হওয়াটা অস্বাভাবিকও নয়। মূলত এই পরীক্ষার ফলের ওপর ভিত্তি করেই তাসকিনের বোলিং নিষিদ্ধ ঘোষণা করে আইসিসি। কিন্তু নিয়ম হলো, ম্যাচের যে ডেলিভারিতে অ্যাকশন সন্দেহজনক মনে হয়েছে, পরীক্ষায় সেটাই করতে বলা হবে বোলারকে। সে অনুযায়ী পরীক্ষায় তাসকিনকে বাউন্সার দিতে বলার কথা নয়। হল্যান্ডের বিপক্ষে যে তিনি কোনো বাউন্সারই দেননি! বাউন্সারে তাঁর অ্যাকশন নিয়ে সন্দেহ ওঠারও তাই কোনো অবকাশ ছিল না ওই ম্যাচে। আইসিসির সিদ্ধান্তে আরেকটি নিয়মেরও ব্যত্যয় ঘটার অভিযোগ আছে। ‘স্টক ডেলিভারি’ ছাড়া অন্য কোনো ডেলিভারিতে কনুই ১৫ ডিগ্রির বেশি বাঁকা হলেও আইসিসি কোনো বোলারের বোলিং নিষিদ্ধ করতে পারে না বলে জানিয়েছে সূত্র। শুধু ভবিষ্যতের জন্য সতর্কই করতে পারে। তাসকিনের অ্যাকশন নিয়ে অভিযোগ তার গুড লেংথ অথবা ইয়র্কার বলগুলোর মতো ‘স্টক ডেলিভারি’তে নয় বলেও তাঁর বোলিংয়ের নিষেধাজ্ঞা নিয়ে প্রশ্ন তোলা যায়।"
				+ "দলের কম্পিউটার বিশ্লেষকদের মাধ্যমে হল্যান্ড ম্যাচের ভিডিও ফুটেজ বিশ্লেষণ করে এসব বিষয়ে আরও নিশ্চিত হন কোচ চন্ডিকা হাথুরুসিংহে। তাসকিনের বোলিং অ্যাকশন নিয়ে প্রশ্ন ওঠার পর তাঁর পরামর্শেই আইনজীবীদের শরণাপন্ন হয় বিসিবি। আম্পায়ারদের আনা অভিযোগ, রামাচন্দ্র বিশ্ববিদ্যালয়ের পরীক্ষাগারে হওয়া তাসকিনের বোলিং অ্যাকশন পরীক্ষা এবং আইসিসির চূড়ান্ত সিদ্ধান্তের যথার্থতা বিবেচনা করে দেখছেন আইনজীবীরা। এ ব্যাপারে বিসিবির আইনি পরামর্শক সুপ্রিম কোর্টের আইনজীবী ব্যারিস্টার মুস্তাফিজুর রহমান খান কাল রাতে মুঠোফোনে এই প্রতিবেদককে বলেছেন, ‘তাসকিনের বোলিং অ্যাকশনের পরীক্ষায় প্রক্রিয়াগত কিছু ত্রুটি আছে। আইসিসির নিয়ম অনুযায়ী এ ধরনের পরীক্ষায় প্রক্রিয়াগত ত্রুটি থাকলে সংশ্লিষ্ট বোর্ড রিভিউ চাইতে পারে। আমি মনে করি বিসিবিরও রিভিউ চাওয়া উচিত।’"
				+ "বিসিবি এখন সেই পথে হাঁটারই চিন্তা করছে বলে জানিয়েছেন নাম প্রকাশে অনিচ্ছুক এক বোর্ড পরিচালক, ‘আমরা তাসকিনের অ্যাকশন পরীক্ষার যাবতীয় কাগজপত্র আমাদের আইনজীবীদের দিয়েছি। তাঁরা সেসব বিশ্লেষণ করে দেখছেন। আইনজীবীদের মতামত নিয়ে প্রয়োজনে এ সিদ্ধান্তের বিরুদ্ধে আমরা আইসিসিতে প্রতিবাদ জানাব।’ একই ইঙ্গিত প্রধান নির্বাহী কর্মকর্তা নিজাম উদ্দিন চৌধুরীর কথায়ও, ‘এই সিদ্ধান্ত আমাদের কাছে বিস্ময়কর। আমরা আইসিসির নিয়মকানুনগুলো বিশ্লেষণ করে দেখছি। সিদ্ধান্ত পুনর্বিবেচনার কোনো সুযোগ থাকলে আমরা বোর্ডের সবার মতামত নিয়ে সে ব্যাপারে আইসিসির দৃষ্টি আকর্ষণের চেষ্টা করব।’"
				+ "অবশ্য বিসিবি এই পথে গেলেও টি-টোয়েন্টি বিশ্বকাপে তাসকিনের খেলার সম্ভাবনা আর নেই। নির্বাচক মিনহাজুল আবেদীন তাই ভীষণ হতাশ, ‘বিশ্বকাপের মাঝখানে দুজন বোলারের বোলিং অ্যাকশন নিয়ে এ রকম সিদ্ধান্ত আমাদের জন্য বিরাট ধাক্কা। এশিয়া কাপেও তারা খেলেছে এবং তখন এ নিয়ে কেউ কিছু বলেনি। এটা খুবই হতাশাজনক।’"
				+ "বাংলাদেশেই যা নিয়ে এত আলোচনা, সেটা বেঙ্গালুরুতে দলের ওপর কতটা প্রভাব ফেলছে, তা তো বোঝাই যায়। কাল টিম হোটেলে সাংবাদিকদের সঙ্গে কথা বলার সময় ম্যানেজার খালেদ মাহমুদ এটাকে বলেছেন ‘অনেক বড় ধাক্কা’। এরপরই অবশ্য খেলোয়াড়দের কালকের অস্ট্রেলিয়া ম্যাচের জন্য চাঙা করতে চাইলেন জাতীয় দলের সাবেক এই অধিনায়ক, ‘আমরা পেশাদার দল এবং এগুলো খেলারই অংশ। আগেও এ রকম অনেক ম্যাচ গেছে, যখন আমরা সানি বা তাসকিনকে দলে পাইনি। আমরা এখন অস্ট্রেলিয়ার মুখোমুখি হওয়ার জন্য প্রস্তুত।’";

		// Output the result
		System.out.println(getPosTagged(sample));
	}

	public static String getPosTagged(String text) throws ClassNotFoundException, IOException {
		// Initialize the tagger
		MaxentTagger tagger = new MaxentTagger("taggers/bengaliModelFile.tagger");
		return tagger.tagString(text);
	}
}
