package shafin.nlp.tokenizer;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

public class SentenceSpliter {

	public static String[] UNICODE_SPACE_CHARACTERS = { "\u0020", "\u00A0", "\u180E", "\u1680", "\u2000", "\u2001",
			"\u2002", "\u2003", "\u2004", "\u2005", "\u2006", "\u2007", "\u2008", "\u2009", "\u200A", "\u200B",
			"\u202F", "\u205F", "\u3000", "\uFEFF" };

	public static String[] getSentenceTokenArrayBn(String text) {
		text = replaceAll(UNICODE_SPACE_CHARACTERS, " ", text);
		text = text.replaceAll("\\s+", " ");

		String pattern = "(?<!\\w\\।\\w।)(?<![A-Z][a-z]\\।)(?<=\\।|\\?)\\s";
		String[] sentences = text.split(pattern);
		return sentences;
	}

	public static List<String> getSentenceTokenListBn(String text) {
		text = replaceAll(UNICODE_SPACE_CHARACTERS, " ", text);
		text = text.replaceAll("\\s+", " ");

		/*
		 * https://regex101.com/r/nG1gU7/142 for the explanation of the pattern
		 */
		String pattern = "(?<!\\w\\।\\w।)(?<![A-Z][a-z]\\।)(?<=।|\\?|।”|।’|\\?”|\\?’|।“|।‘|\\?“|\\?‘)\\s";
		String[] sentences = text.split(pattern);
		return new ArrayList<String>(Arrays.asList(sentences));
	}

	public static String replaceAll(String[] shitStrings, String replaceWith, String text) {
		for (int i = 0; i < shitStrings.length; i++) {
			text = text.replaceAll(shitStrings[i], replaceWith);
		}
		return text;
	}

	public static void main(String[] args) {
		String text = "ঢাকার গুলশানে কমান্ডো অভিযানের মধ্য দিয়ে ১২ ঘণ্টা পর জিম্মি সংকটের অবসান ঘটেছে৷ এ ঘটনায় ২০ জিম্মি ও "
				+ "৬ বন্দুকধারী নিহত হয়েছে বলে জানিয়েছে সামরিক বাহিনী৷ একজনকে আটক করা হয়েছে বলে জানিয়েছেন প্রধানমন্ত্রী শেখ হাসিনা৷ "
				+ "ঐ রেস্টুরেন্টে সন্ত্রাসী হামলায় ২০ জন নিহত হয়েছে বলে নিশ্চিত করেছে আন্ত:বাহিনী জনসংযোগ পরিদপ্তর বা আইএসপিআর৷ জিম্মি করার "
				+ "পর ধারালো অস্ত্র দিয়ে রাতেই তাদের হত্যা করা হয় বলে সংবাদ সম্মেলনে জানানো হয়েছে৷ ব্রিগেডিয়ার জেনারেল নাঈম আশফাক বলেন, "
				+ "অভিযানকারীরা ভেতরে ঢোকার পর ২০ জনের মৃতদেহ পায়৷এছাড়া অভিযানে ৬ জন হামলাকারী নিহত হয়েছে এবং একজনকে আটক করা "
				+ "হয়েছে বলে জানান তিনি৷ সেনাবাহিনীর নেতৃত্বে ঐ অভিযানটির নাম দেয়া হয়েছে অপারেশন থান্ডারবোল্ট৷ সেনা কমান্ডোরা ছাড়াও নৌ, পুলিশ,"
				+ " বিজিবি এবং র‍্যাবের সদস্যরা অংশ নেন৷ রেস্টুরেন্ট থেকে উদ্ধারকৃতদের মধ্যে এক জন জাপানী এবং দুই জন শ্রীলঙ্কান নাগরিক রয়েছেন৷ ১৩"
				+ " জিম্মিকে উদ্ধার করা হয়েছে, যাদের মধ্যে চারজন বিদেশি নাগরিক৷ হলি আর্টিজান বেকারিতে শনিবার সকাল সাড়ে ৭টা থেকে"
				+ " ঘণ্টাখানেকের এই অভিযান চালানো হয় বলে জানিয়েছেন এক র‌্যাব কর্মকর্তা৷ নিহতরা জিম্মি না হামলাকারী সে বিষয়ে "
				+ " এখনও স্পষ্ট কোনো তথ্য পাওয়া যায়নি৷ অভিযানের শুরুতেই নারী ও শিশুসহ পাঁচজনকে উদ্ধার করা হয়৷ তবে সেখানে ঠিক "
				+ "কতজন আটকা পড়েছিলেন এবং তাঁদের মধ্যে কতজন জীবিত উদ্ধার হয়েছেন - তা এখনও স্পষ্ট হয়নি৷ জিম্মি ঘটনার অবসানের "
				+ "পরপরই বিশ্বের প্রধান প্রধান গণমাধ্যম সংবাদটি প্রচার করে৷ ডয়চে ভেলের কন্টেন্ট পার্টনার বিডিনিউজ টোয়েন্টিফোর ডটকম জানিয়েছে, "
				+ "প্যারা কমান্ডোদের সঙ্গে সেনাবাহিনীর সাঁজোয়া যান অংশ নেয় অভিযানে৷ এক প্রত্যক্ষদর্শী জানিয়েছেন, থেমে থেমে গুলি ও বিস্ফোরণের শব্দ শুনেছেন তিনি৷ "
				+ "সেনা সাঁজোয়া যান হলি বেকারির দেয়াল ভেঙে ভেতরে ঢোকে৷ অন্তত একজন বিদেশি নাগরিক সেখানে গুলিবিদ্ধ হয়েছেন বলে তথ্য পাওয়া গেলেও, "
				+ "পুলিশ কর্মকর্তারা তাৎক্ষণিকভাবে এ বিষয়ে কোনো মন্তব্য করেনি৷ গণমাধ্যমগুলো জানিয়েছে, "
				+ "ঘটনার দায় স্বীকার করেছে তথাকথিত ইসলামিক স্টেট বা আইএস৷ প্রত্যক্ষদর্শীর বিবরণ অনুযায়ী, "
				+ "শুক্রবার রাত পৌনে ৯টার দিকে ‘আল্লাহু আকবর' "
				+ "বলে একদল অস্ত্রধারী গুলশানের হলি আর্টিজান বেকারিতে হামলা চালালে অবস্থানরত অজ্ঞাত সংখ্যক অতিথি সেখানে আটকা পড়েন৷ "
				+ "পরিস্থিতি সামাল দিতে গিয়ে নিহত হন বনানী থানার ওসি সালাউদ্দিন ও গোয়েন্দা পুলিশের সহকারী কমিশনার রবিউল ইসলাম৷ কারা এবং "
				+ "কেন অতর্কিত এ হামলা চালিয়েছে সে বিষয়ে পুলিশ এখনো স্পষ্ট কোনো তথ্য দিতে পারেনি৷ প্রত্যক্ষদর্শীর দেয়া বর্ণনা তুলে ধরেছেন অধ্যাপক ম্যাক্স আব্রাহামস..."
				+ " রাতে হামলার পরপরই ক্যাফে থেকে অক্ষত অবস্থায় বেরিয়ে আসতে সক্ষম হন এমন একজন কর্মী বলেছিলেন, অন্তত ২০ জন সেখানে ছিলেন তখন, "
				+ "যাদের মধ্যে ছিলেন বেশ কয়েকজন বিদেশি৷ এপিবি/ডিজি";
		for (String string : getSentenceTokenListBn(text))
			System.out.println(string);
	}
}
